In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import scipy.stats as sts

In [25]:
hdi = pd.read_csv('./Book4.csv')
hdi

  column 1  year  column 2  column 3  column 4
0      usa  2000       NaN       5.0       6.0
1      usa  2000       2.0       NaN       NaN
2   mexico  1999       3.0       NaN       6.0
3   mexico  1999       NaN       4.0       NaN
4    china  2000       3.0       NaN       NaN
5    china  2000       NaN       9.0       5.0
6    china  1999       3.0       NaN       4.0
7    china  1999       NaN      43.0       NaN

In [7]:
hdi.groupby('column 1')[['column 2', 'column 3' , 'column 3']].first().reset_index()

  column 1  column 2  column 3  column 3
0    china       3.0       NaN       NaN
1   mexico       3.0       4.0       4.0
2      usa       2.0       5.0       5.0

In [27]:
pd.concat([ hdi.apply(lambda x: sorted(x, key=pd.isnull)) for _, hdi in hdi.groupby('column 1')]).dropna()

  column 1  year  column 2  column 3  column 4
4    china  2000       3.0       9.0       5.0
5    china  2000       3.0      43.0       4.0
2   mexico  1999       3.0       4.0       6.0
0      usa  2000       2.0       5.0       6.0

In [28]:
hdi.groupby(['column 1' , 'year']).first().reset_index()

ValueError: No axis named year for object type DataFrame